{
	"class": "patch",
	"id": "oval:com.redhat.rhsa:def:20120304",
	"version": "647",
	"metadata": {
		"title": "RHSA-2012:0304: vixie-cron security, bug fix, and enhancement update (Low)",
		"affected": {
			"family": "unix",
			"platform": [
				"Red Hat Enterprise Linux 5"
			]
		},
		"reference": [
			{
				"ref_id": "RHSA-2012:0304",
				"ref_url": "https://access.redhat.com/errata/RHSA-2012:0304",
				"source": "RHSA"
			},
			{
				"ref_id": "CVE-2010-0424",
				"ref_url": "https://access.redhat.com/security/cve/CVE-2010-0424",
				"source": "CVE"
			}
		],
		"description": "The vixie-cron package contains the Vixie version of cron. Cron is a\nstandard UNIX daemon that runs specified programs at scheduled times. The\nvixie-cron package adds improved security and more powerful configuration\noptions to the standard version of cron.\n\nA race condition was found in the way the crontab program performed file\ntime stamp updates on a temporary file created when editing a user crontab\nfile. A local attacker could use this flaw to change the modification time\nof arbitrary system files via a symbolic link attack. (CVE-2010-0424)\n\nRed Hat would like to thank Dan Rosenberg for reporting this issue.\n\nThis update also fixes the following bugs:\n\n* Cron jobs of users with home directories mounted on a Lightweight\nDirectory Access Protocol (LDAP) server or Network File System (NFS) were\noften refused because jobs were marked as orphaned (typically due to a\ntemporary NSS lookup failure, when NIS and LDAP servers were unreachable).\nWith this update, a database of orphans is created, and cron jobs are\nperformed as expected. (BZ#455664)\n\n* Previously, cron did not log any errors if a cron job file located in the\n/etc/cron.d/ directory contained invalid entries. An upstream patch has\nbeen applied to address this problem and invalid entries in the cron job\nfiles now produce warning messages. (BZ#460070)\n\n* Previously, the \"@reboot\" crontab macro incorrectly ran jobs when the\ncrond daemon was restarted. If the user used the macro on multiple\nmachines, all entries with the \"@reboot\" option were executed every time\nthe crond daemon was restarted. With this update, jobs are executed only\nwhen the machine is rebooted. (BZ#476972)\n\n* The crontab utility is now compiled as a position-independent executable\n(PIE), which enhances the security of the system. (BZ#480930)\n\n* When the parent crond daemon was stopped, but a child crond daemon was\nrunning (executing a program), the \"service crond status\" command\nincorrectly reported that crond was running. The source code has been\nmodified, and the \"service crond status\" command now correctly reports that\ncrond is stopped. (BZ#529632)\n\n* According to the pam(8) manual page, the cron daemon, crond, supports\naccess control with PAM (Pluggable Authentication Module). However, the PAM\nconfiguration file for crond did not export environment variables correctly\nand, consequently, setting PAM variables via cron did not work. This update\nincludes a corrected /etc/pam.d/crond file that exports environment\nvariables correctly. Setting pam variables via cron now works as documented\nin the pam(8) manual page. (BZ#541189)\n\n* Previously, the mcstransd daemon modified labels for the crond daemon.\nWhen the crond daemon attempted to use the modified label and mcstransd was\nnot running, crond used an incorrect label. Consequently, Security-Enhanced\nLinux (SELinux) denials filled up the cron log, no jobs were executed, and\ncrond had to be restarted. With this update, both mcstransd and crond use\nraw SELinux labels, which prevents the problem. (BZ#625016)\n\n* Previously, the crontab(1) and cron(8) manual pages contained multiple\ntypographical errors. This update fixes those errors. (BZ#699620,\nBZ#699621)\n\nIn addition, this update adds the following enhancement:\n\n* Previously, the crontab utility did not use the Pluggable Authentication\nModule (PAM) for verification of users. As a consequence, a user could\naccess crontab even if access had been restricted (usually by being denied\nin the access.conf file). With this update, crontab returns an error\nmessage that the user is not allowed to access crontab because of PAM\nconfiguration. (BZ#249512)\n\nAll vixie-cron users should upgrade to this updated package, which resolves\nthese issues and adds this enhancement.",
		"advisory": {
			"from": "secalert@redhat.com",
			"severity": "Low",
			"rights": "Copyright 2012 Red Hat, Inc.",
			"issued": {
				"date": "2012-02-21"
			},
			"updated": {
				"date": "2012-02-21"
			},
			"cve": [
				{
					"text": "CVE-2010-0424",
					"href": "https://access.redhat.com/security/cve/CVE-2010-0424",
					"impact": "low",
					"public": "20100218",
					"cvss_2": "3.6/AV:L/AC:L/Au:N/C:N/I:P/A:P"
				}
			],
			"bugzilla": [
				{
					"text": "CVE-2010-0424 vixie-cron, cronie: Race condition by setting timestamp of user's crontab file, when editing the file",
					"href": "https://bugzilla.redhat.com/565809",
					"id": "565809"
				}
			],
			"affected_cpe_list": {
				"cpe": [
					"cpe:/o:redhat:enterprise_linux:5",
					"cpe:/o:redhat:enterprise_linux:5::client",
					"cpe:/o:redhat:enterprise_linux:5::server"
				]
			}
		}
	},
	"criteria": {
		"operator": "OR",
		"criterias": [
			{
				"operator": "AND",
				"criterions": [
					{
						"test_ref": "oval:com.redhat.rhba:tst:20070331005",
						"comment": "Red Hat Enterprise Linux 5 is installed"
					},
					{
						"test_ref": "oval:com.redhat.rhsa:tst:20120304001",
						"comment": "vixie-cron is earlier than 4:4.1-81.el5"
					},
					{
						"test_ref": "oval:com.redhat.rhsa:tst:20070345005",
						"comment": "vixie-cron is signed with Red Hat redhatrelease key"
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:com.redhat.rhba:tst:20070331006",
				"comment": "Red Hat Enterprise Linux must be installed"
			}
		]
	}
}
