{
  "class": "patch",
  "id": "oval:com.redhat.rhsa:def:20130126",
  "version": "638",
  "metadata": {
    "title": "RHSA-2013:0126: squirrelmail security and bug fix update (Low)",
    "affected": {
      "family": "unix",
      "platform": [
        "Red Hat Enterprise Linux 5"
      ]
    },
    "reference": [
      {
        "ref_id": "RHSA-2013:0126",
        "ref_url": "https://access.redhat.com/errata/RHSA-2013:0126",
        "source": "RHSA"
      },
      {
        "ref_id": "CVE-2012-2124",
        "ref_url": "https://access.redhat.com/security/cve/CVE-2012-2124",
        "source": "CVE"
      }
    ],
    "description": "SquirrelMail is a standards-based webmail package written in PHP.\n\nThe SquirrelMail security update RHSA-2012:0103 did not, unlike the erratum\ntext stated, correct the CVE-2010-2813 issue, a flaw in the way\nSquirrelMail handled failed log in attempts. A user preference file was\ncreated when attempting to log in with a password containing an 8-bit\ncharacter, even if the username was not valid. A remote attacker could use\nthis flaw to eventually consume all hard disk space on the target\nSquirrelMail server. (CVE-2012-2124)\n\nThis update also fixes the following bugs:\n\n* Prior to this update, SquirrelMail could not decode multi-line subjects\nproperly. Consequently, the decode header internationalization option did\nnot properly handle new lines or tabs at the beginning of the lines. This\nbug has been fixed and SquirrelMail now works correctly in the described\nscenario. (BZ#241861)\n\n* Due to a bug, attachments written in HTML code on the Windows operating\nsystem were not displayed properly when accessed with SquirrelMail; the\n\"!=null\" string was trimmed to \"!ull\". This bug has been fixed and the\nattachments are now displayed correctly in such a case. (BZ#359791)\n\n* Previously, e-mail messages with a Unique Identifier (UID) larger than\n2^31 bytes were unreadable when using the squirrelmail package. With this\npatch the squirrelmail package is able to read all messages regardless of\nthe UIDs size. (BZ#450780)\n\n* Due to a bug, a PHP script did not assign the proper character set to\nrequested variables. Consequently, SquirrelMail could not display any\ne-mails. The underlying source code has been modified and now the\nsquirrelmail package assigns the correct character set. (BZ#475188)\n\n* Due to the incorrect internationalization option located at the i18n.php\nfile, the squirrelmail package could not use the GB 2312 character set. The\ni18n.php file has been fixed and the GB 2312 character set works correctly\nin the described scenario. (BZ#508686)\n\n* Previously, the preg_split() function contained a misspelled constant,\nPREG_SPLIT_NI_EMPTY, which could cause SquirrelMail to produce error\nmessages. The name of the constant has been corrected to\nPREG_SPLIT_NO_EMPTY, and SquirrelMail no longer produces error messages in\nthis scenario. (BZ#528758)\n\n* Due to Security-Enhanced Linux (SELinux) settings, sending e-mails from\nthe SquirrelMail web interface was blocked. This update adds a note to the\nSquirrelMail documentation that describes how to set the SELinux options to\nallow sending e-mails from the SquirrelMail web interface. (BZ#745380)\n\n* Previously, the squirrelmail package did not comply with the RFC 2822\nspecification about line length limits. Consequently, attachments with\nlines longer than 998 characters could not be forwarded using SquirrelMail.\nThis patch modifies the underlying source code and now SquirrelMail\ncomplies with the RFC 2822 specification as expected. (BZ#745469)\n\n* Prior to this update, the squirrelmail package required the php-common\nscript instead of the mod_php script during installation or upgrade of the\npackage, which led to a dependency error. As a result, attempting to\ninstall or upgrade the squirrelmail package failed on systems using the\nphp53 packages. With this update, the dependencies of the squirrelmail\npackage were changed and the installation or upgrade now works correctly in\nthe described scenario. (BZ#789353)\n\nAll users of SquirrelMail are advised to upgrade to this updated package,\nwhich contains backported patches to correct these issues.",
    "advisory": {
      "from": "secalert@redhat.com",
      "severity": "Low",
      "rights": "Copyright 2013 Red Hat, Inc.",
      "issued": {
        "date": "2013-01-08"
      },
      "updated": {
        "date": "2013-01-08"
      },
      "cve": [
        {
          "text": "CVE-2012-2124",
          "href": "https://access.redhat.com/security/cve/CVE-2012-2124",
          "impact": "low",
          "public": "20120420",
          "cvss_2": "5.0/AV:N/AC:L/Au:N/C:N/I:N/A:P"
        }
      ],
      "bugzilla": [
        {
          "text": "CVE-2012-2124 squirrelmail: CVE-2010-2813 not fixed in RHSA-2012:0103",
          "href": "https://bugzilla.redhat.com/814671",
          "id": "814671"
        }
      ],
      "affected_cpe_list": {
        "cpe": [
          "cpe:/o:redhat:enterprise_linux:5",
          "cpe:/o:redhat:enterprise_linux:5::client_workstation",
          "cpe:/o:redhat:enterprise_linux:5::server"
        ]
      }
    }
  },
  "criteria": {
    "operator": "OR",
    "criterias": [
      {
        "operator": "AND",
        "criterions": [
          {
            "test_ref": "oval:com.redhat.rhba:tst:20070331005",
            "comment": "Red Hat Enterprise Linux 5 is installed"
          },
          {
            "test_ref": "oval:com.redhat.rhsa:tst:20130126001",
            "comment": "squirrelmail is earlier than 0:1.4.8-21.el5"
          },
          {
            "test_ref": "oval:com.redhat.rhsa:tst:20070358005",
            "comment": "squirrelmail is signed with Red Hat redhatrelease key"
          }
        ]
      }
    ],
    "criterions": [
      {
        "test_ref": "oval:com.redhat.rhba:tst:20070331006",
        "comment": "Red Hat Enterprise Linux must be installed"
      }
    ]
  }
}
