{
	"class": "patch",
	"id": "oval:com.redhat.rhsa:def:20111000",
	"version": "653",
	"metadata": {
		"title": "RHSA-2011:1000: rgmanager security, bug fix, and enhancement update (Low)",
		"affected": {
			"family": "unix",
			"platform": [
				"Red Hat Enterprise Linux 5"
			]
		},
		"reference": [
			{
				"ref_id": "RHSA-2011:1000",
				"ref_url": "https://access.redhat.com/errata/RHSA-2011:1000",
				"source": "RHSA"
			},
			{
				"ref_id": "CVE-2010-3389",
				"ref_url": "https://access.redhat.com/security/cve/CVE-2010-3389",
				"source": "CVE"
			}
		],
		"description": "The rgmanager package contains the Red Hat Resource Group Manager, which\nprovides the ability to create and manage high-availability server\napplications in the event of system downtime.\n\nIt was discovered that certain resource agent scripts set the\nLD_LIBRARY_PATH environment variable to an insecure value containing empty\npath elements. A local user able to trick a user running those scripts to\nrun them while working from an attacker-writable directory could use this\nflaw to escalate their privileges via a specially-crafted dynamic library.\n(CVE-2010-3389)\n\nRed Hat would like to thank Raphael Geissert for reporting this issue.\n\nThis update also fixes the following bugs:\n\n* The failover domain \"nofailback\" option was not honored if a service was\nin the \"starting\" state. This bug has been fixed. (BZ#669440)\n\n* PID files with white spaces in the file name are now handled correctly.\n(BZ#632704)\n\n* The /usr/sbin/rhev-check.sh script can now be used from within Cron.\n(BZ#634225)\n\n* The clustat utility now reports the correct version. (BZ#654160)\n\n* The oracledb.sh agent now attempts to try the \"shutdown immediate\"\ncommand instead of using the \"shutdown abort\" command. (BZ#633992)\n\n* The SAPInstance and SAPDatabase scripts now use proper directory name\nquoting so they no longer collide with directory names like \"/u\".\n(BZ#637154)\n\n* The clufindhostname utility now returns the correct value in all cases.\n(BZ#592613)\n\n* The nfsclient resource agent now handles paths with trailing slashes\ncorrectly. (BZ#592624)\n\n* The last owner of a service is now reported correctly after a failover.\n(BZ#610483)\n\n* The /usr/share/cluster/fs.sh script no longer runs the \"quotaoff\" command\nif quotas were not configured. (BZ#637678)\n\n* The \"listen\" line in the /etc/httpd/conf/httpd.conf file generated by the\nApache resource agent is now correct. (BZ#675739)\n\n* The tomcat-5 resource agent no longer generates incorrect configurations.\n(BZ#637802)\n\n* The time required to stop an NFS resource when the server is unavailable\nhas been reduced. (BZ#678494)\n\n* When using exclusive prioritization, a higher priority service now\npreempts a lower priority service after status check failures. (BZ#680256)\n\n* The postgres-8 resource agent now correctly detects failed start\noperations. (BZ#663827)\n\n* The handling of reference counts passed by rgmanager to resource agents\nnow works properly, as expected. (BZ#692771)\n\nAs well, this update adds the following enhancements:\n\n* It is now possible to disable updates to static routes by the IP resource\nagent. (BZ#620700)\n\n* It is now possible to use XFS as a file system within a cluster service.\n(BZ#661893)\n\n* It is now possible to use the \"clustat\" command as a non-root user, so\nlong as that user is in the \"root\" group. (BZ#510300)\n\n* It is now possible to migrate virtual machines when central processing is\nenabled. (BZ#525271)\n\n* The rgmanager init script will now delay after stopping services in order\nto allow time for other nodes to restart them. (BZ#619468)\n\n* The handling of failed independent subtrees has been corrected.\n(BZ#711521)\n\nAll users of Red Hat Resource Group Manager are advised to upgrade to this\nupdated package, which contains backported patches to correct these issues\nand add these enhancements.",
		"advisory": {
			"from": "secalert@redhat.com",
			"severity": "Low",
			"rights": "Copyright 2011 Red Hat, Inc.",
			"issued": {
				"date": "2011-07-21"
			},
			"updated": {
				"date": "2011-07-21"
			},
			"cve": [
				{
					"text": "CVE-2010-3389",
					"href": "https://access.redhat.com/security/cve/CVE-2010-3389",
					"impact": "low",
					"public": "20100930",
					"cvss_2": "3.7/AV:L/AC:H/Au:N/C:P/I:P/A:P"
				}
			],
			"bugzilla": [
				{
					"text": "CVE-2010-3389 rgmanager: insecure library loading vulnerability",
					"href": "https://bugzilla.redhat.com/639044",
					"id": "639044"
				}
			],
			"affected_cpe_list": {
				"cpe": [
					"cpe:/a:redhat:rhel_cluster:5"
				]
			}
		}
	},
	"criteria": {
		"operator": "OR",
		"criterias": [
			{
				"operator": "AND",
				"criterions": [
					{
						"test_ref": "oval:com.redhat.rhba:tst:20070331005",
						"comment": "Red Hat Enterprise Linux 5 is installed"
					},
					{
						"test_ref": "oval:com.redhat.rhsa:tst:20111000001",
						"comment": "rgmanager is earlier than 0:2.0.52-21.el5"
					},
					{
						"test_ref": "oval:com.redhat.rhsa:tst:20091339002",
						"comment": "rgmanager is signed with Red Hat redhatrelease key"
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:com.redhat.rhba:tst:20070331006",
				"comment": "Red Hat Enterprise Linux must be installed"
			}
		]
	}
}
