{
	"class": "patch",
	"id": "oval:com.redhat.rhsa:def:20091339",
	"version": "649",
	"metadata": {
		"title": "RHSA-2009:1339: rgmanager security, bug fix, and enhancement update (Low)",
		"affected": {
			"family": "unix",
			"platform": [
				"Red Hat Enterprise Linux 5"
			]
		},
		"reference": [
			{
				"ref_id": "RHSA-2009:1339",
				"ref_url": "https://access.redhat.com/errata/RHSA-2009:1339",
				"source": "RHSA"
			},
			{
				"ref_id": "CVE-2008-6552",
				"ref_url": "https://access.redhat.com/security/cve/CVE-2008-6552",
				"source": "CVE"
			}
		],
		"description": "The rgmanager package contains the Red Hat Resource Group Manager, which\nprovides high availability for critical server applications in the event of\nsystem downtime.\n\nMultiple insecure temporary file use flaws were discovered in rgmanager and\nvarious resource scripts run by rgmanager. A local attacker could use these\nflaws to overwrite an arbitrary file writable by the rgmanager process\n(i.e. user root) with the output of rgmanager or a resource agent via a\nsymbolic link attack. (CVE-2008-6552)\n\nThis update also fixes the following bugs:\n\n* clulog now accepts '-' as the first character in messages.\n\n* if expire_time is 0, max_restarts is no longer ignored.\n\n* the SAP resource agents included in the rgmanager package shipped with\nRed Hat Enterprise Linux 5.3 were outdated. This update includes the most\nrecent SAP resource agents and, consequently, improves SAP failover\nsupport.\n\n* empty PID files no longer cause resource start failures.\n\n* recovery policy of type 'restart' now works properly when using a\nresource based on ra-skelet.sh.\n\n* samba.sh has been updated to kill the PID listed in the proper PID file.\n\n* handling of the '-F' option has been improved to fix issues causing\nrgmanager to crash if no members of a restricted failover domain were\nonline.\n\n* the number of simultaneous status checks can now be limited to prevent\nload spikes.\n\n* forking and cloning during status checks has been optimized to reduce\nload spikes.\n\n* rg_test no longer hangs when run with large cluster configuration files.\n\n* when rgmanager is used with a restricted failover domain it will no\nlonger occasionally segfault when some nodes are offline during a failover\nevent.\n\n* virtual machine guests no longer restart after a cluster.conf update.\n\n* nfsclient.sh no longer leaves temporary files after running.\n\n* extra checks from the Oracle agents have been removed.\n\n* vm.sh now uses libvirt.\n\n* users can now define an explicit service processing order when\ncentral_processing is enabled.\n\n* virtual machine guests can no longer start on 2 nodes at the same time.\n\n* in some cases a successfully migrated virtual machine guest could restart\nwhen the cluster.conf file was updated.\n\n* incorrect reporting of a service being started when it was not started\nhas been addressed.\n\nAs well, this update adds the following enhancements:\n\n* a startup_wait option has been added to the MySQL resource agent.\n\n* services can now be prioritized.\n\n* rgmanager now checks to see if it has been killed by the OOM killer and\nif so, reboots the node.\n\nUsers of rgmanager are advised to upgrade to this updated package, which\nresolves these issues and adds these enhancements.",
		"advisory": {
			"from": "secalert@redhat.com",
			"severity": "Low",
			"rights": "Copyright 2009 Red Hat, Inc.",
			"issued": {
				"date": "2009-09-02"
			},
			"updated": {
				"date": "2009-09-02"
			},
			"cve": [
				{
					"text": "CVE-2008-6552",
					"href": "https://access.redhat.com/security/cve/CVE-2008-6552",
					"impact": "low",
					"public": "20081031",
					"cwe": "CWE-377",
					"cvss_2": "5.4/AV:L/AC:M/Au:N/C:N/I:P/A:C"
				}
			],
			"bugzilla": [
				{
					"text": "CVE-2008-6552 cman, gfs2-utils, rgmanager: multiple insecure temporary file use issues",
					"href": "https://bugzilla.redhat.com/519436",
					"id": "519436"
				}
			],
			"affected_cpe_list": {
				"cpe": [
					"cpe:/a:redhat:rhel_cluster:5"
				]
			}
		}
	},
	"criteria": {
		"operator": "OR",
		"criterias": [
			{
				"operator": "AND",
				"criterions": [
					{
						"test_ref": "oval:com.redhat.rhba:tst:20070331005",
						"comment": "Red Hat Enterprise Linux 5 is installed"
					},
					{
						"test_ref": "oval:com.redhat.rhsa:tst:20091339001",
						"comment": "rgmanager is earlier than 0:2.0.52-1.el5"
					},
					{
						"test_ref": "oval:com.redhat.rhsa:tst:20091339002",
						"comment": "rgmanager is signed with Red Hat redhatrelease key"
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:com.redhat.rhba:tst:20070331006",
				"comment": "Red Hat Enterprise Linux must be installed"
			}
		]
	}
}
