{
	"class": "patch",
	"id": "oval:com.redhat.rhsa:def:20080061",
	"version": "645",
	"metadata": {
		"title": "RHSA-2008:0061: setroubleshoot security and bug fix update (Moderate)",
		"affected": {
			"family": "unix",
			"platform": [
				"Red Hat Enterprise Linux 5"
			]
		},
		"reference": [
			{
				"ref_id": "RHSA-2008:0061",
				"ref_url": "https://access.redhat.com/errata/RHSA-2008:0061",
				"source": "RHSA"
			},
			{
				"ref_id": "CVE-2007-5495",
				"ref_url": "https://access.redhat.com/security/cve/CVE-2007-5495",
				"source": "CVE"
			},
			{
				"ref_id": "CVE-2007-5496",
				"ref_url": "https://access.redhat.com/security/cve/CVE-2007-5496",
				"source": "CVE"
			}
		],
		"description": "The setroubleshoot packages provide tools to help diagnose SELinux\nproblems. When AVC messages occur, an alert is generated that gives\ninformation about the problem, and how to create a resolution.\n\nA flaw was found in the way sealert wrote diagnostic messages to a\ntemporary file. A local unprivileged user could perform a symbolic link\nattack, and cause arbitrary files, writable by other users, to be\noverwritten when a victim runs sealert. (CVE-2007-5495)\n\nA flaw was found in the way sealert displayed records from the\nsetroubleshoot database as unescaped HTML. An local unprivileged attacker\ncould cause AVC denial events with carefully crafted process or file names,\ninjecting arbitrary HTML tags into the logs, which could be used as a\nscripting attack, or to confuse the user running sealert. (CVE-2007-5496)\n\nAdditionally, the following bugs have been fixed in these update packages:\n\n* in certain situations, the sealert process used excessive CPU. These\nalerts are now capped at a maximum of 30, D-Bus is used instead of polling,\nthreads causing excessive wake-up have been removed, and more robust\nexception-handling has been added.\n\n* different combinations of the sealert '-a', '-l', '-H', and '-v' options\ndid not work as documented.\n\n* the SETroubleShoot browser did not allow multiple entries to be deleted. \n\n* the SETroubleShoot browser did not display statements that displayed\nwhether SELinux was using Enforcing or Permissive mode, particularly when\nwarning about SELinux preventions.\n\n* in certain cases, the SETroubleShoot browser gave incorrect instructions\nregarding paths, and would not display the full paths to files.\n\n* adding an email recipient to the recipients option from the\n/etc/setroubleshoot/setroubleshoot.cfg file and then generating an SELinux\ndenial caused a traceback error. The recipients option has been removed;\nemail addresses are now managed through the SETroubleShoot browser by\nnavigating to File -> Edit Email Alert List, or by editing the\n/var/lib/setroubleshoot/email_alert_recipients file.\n\n* the setroubleshoot browser incorrectly displayed a period between the\nhttpd_sys_content_t context and the directory path.\n\n* on the PowerPC architecture, The get_credentials() function in\naccess_control.py would generate an exception when it called the\nsocket.getsockopt() function.\n\n* The code which handles path information has been completely rewritten so\nthat assumptions on path information which were misleading are no longer\nmade. If the path information is not present, it will be presented as\n\"<Unknown>\".\n\n* setroubleshoot had problems with non-English locales under certain\ncircumstances, possibly causing a python traceback, an sealert window\npop-up containing an error, a \"RuntimeError: maximum recursion depth\nexceeded\" error after a traceback, or a \"UnicodeEncodeError\" after a traceback.\n\n* sealert ran even when SELinux was disabled, causing \"attempt to open\nserver connection failed\" errors. Sealert now checks whether SELinux is\nenabled or disabled.\n\n* the database setroubleshoot maintains was world-readable. The\nsetroubleshoot database is now mode 600, and is owned by the root user and\ngroup.\n\n* setroubleshoot did not validate requests to set AVC filtering options for\nusers. In these updated packages, checks ensure that requests originate\nfrom the filter owner.\n\n* the previous setroubleshoot packages required a number of GNOME packages\nand libraries. setroubleshoot has therefore been split into 2 packages:\nsetroubleshoot and setroubleshoot-server.\n\n* a bug in decoding the audit field caused an \"Input is not proper UTF-8,\nindicate encoding!\" error message. The decoding code has been rewritten.\n\n* a file name mismatch in the setroubleshoot init script would cause a\nfailure to shut down.\n\nUsers of setroubleshoot are advised to upgrade to these updated packages,\nwhich resolve these issues.",
		"advisory": {
			"from": "secalert@redhat.com",
			"severity": "Moderate",
			"rights": "Copyright 2008 Red Hat, Inc.",
			"issued": {
				"date": "2008-05-20"
			},
			"updated": {
				"date": "2008-05-21"
			},
			"cve": [
				{
					"text": "CVE-2007-5495",
					"href": "https://access.redhat.com/security/cve/CVE-2007-5495",
					"impact": "low",
					"public": "20080521"
				},
				{
					"text": "CVE-2007-5496",
					"href": "https://access.redhat.com/security/cve/CVE-2007-5496",
					"impact": "moderate",
					"public": "20080521"
				}
			],
			"bugzilla": [
				{
					"text": "CVE-2007-5495 setroubleshoot insecure logging",
					"href": "https://bugzilla.redhat.com/288221",
					"id": "288221"
				},
				{
					"text": "CVE-2007-5496 setroubleshoot log injection",
					"href": "https://bugzilla.redhat.com/288271",
					"id": "288271"
				}
			],
			"affected_cpe_list": {
				"cpe": [
					"cpe:/o:redhat:enterprise_linux:5",
					"cpe:/o:redhat:enterprise_linux:5::client",
					"cpe:/o:redhat:enterprise_linux:5::server"
				]
			}
		}
	},
	"criteria": {
		"operator": "OR",
		"criterias": [
			{
				"operator": "AND",
				"criterias": [
					{
						"operator": "OR",
						"criterias": [
							{
								"operator": "AND",
								"criterions": [
									{
										"test_ref": "oval:com.redhat.rhsa:tst:20080061001",
										"comment": "setroubleshoot-plugins is earlier than 0:2.0.4-2.el5"
									},
									{
										"test_ref": "oval:com.redhat.rhsa:tst:20080061002",
										"comment": "setroubleshoot-plugins is signed with Red Hat redhatrelease2 key"
									}
								]
							},
							{
								"operator": "AND",
								"criterions": [
									{
										"test_ref": "oval:com.redhat.rhsa:tst:20080061003",
										"comment": "setroubleshoot is earlier than 0:2.0.5-3.el5"
									},
									{
										"test_ref": "oval:com.redhat.rhsa:tst:20080061004",
										"comment": "setroubleshoot is signed with Red Hat redhatrelease2 key"
									}
								]
							},
							{
								"operator": "AND",
								"criterions": [
									{
										"test_ref": "oval:com.redhat.rhsa:tst:20080061005",
										"comment": "setroubleshoot-server is earlier than 0:2.0.5-3.el5"
									},
									{
										"test_ref": "oval:com.redhat.rhsa:tst:20080061006",
										"comment": "setroubleshoot-server is signed with Red Hat redhatrelease2 key"
									}
								]
							}
						]
					}
				],
				"criterions": [
					{
						"test_ref": "oval:com.redhat.rhba:tst:20070331005",
						"comment": "Red Hat Enterprise Linux 5 is installed"
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:com.redhat.rhba:tst:20070331006",
				"comment": "Red Hat Enterprise Linux must be installed"
			}
		]
	}
}
