{
  "class": "patch",
  "id": "oval:com.redhat.rhsa:def:20130124",
  "version": "643",
  "metadata": {
    "title": "RHSA-2013:0124: net-snmp security and bug fix update (Moderate)",
    "affected": {
      "family": "unix",
      "platform": [
        "Red Hat Enterprise Linux 5"
      ]
    },
    "reference": [
      {
        "ref_id": "RHSA-2013:0124",
        "ref_url": "https://access.redhat.com/errata/RHSA-2013:0124",
        "source": "RHSA"
      },
      {
        "ref_id": "CVE-2012-2141",
        "ref_url": "https://access.redhat.com/security/cve/CVE-2012-2141",
        "source": "CVE"
      }
    ],
    "description": "These packages provide various libraries and tools for the Simple Network\nManagement Protocol (SNMP).\n\nAn out-of-bounds buffer read flaw was found in the net-snmp agent. A remote\nattacker with read privileges to a Management Information Base (MIB)\nsubtree handled by the \"extend\" directive (in \"/etc/snmp/snmpd.conf\") could\nuse this flaw to crash snmpd via a crafted SNMP GET request.\n(CVE-2012-2141)\n\nBug fixes:\n\n* Devices that used certain file systems were not reported in the\n\"HOST-RESOURCES-MIB::hrStorageTable\" table. As a result, the snmpd daemon\ndid not recognize devices using tmpfs, ReiserFS, and Oracle Cluster File\nSystem (OCFS2) file systems. This update recognizes these devices and\nreports them in the \"HOST-RESOURCES-MIB::hrStorageTable\" table.\n(BZ#754652, BZ#755958, BZ#822061)\n\n* The snmptrapd (8) man page did not correctly describe how to load\nmultiple configuration files using the \"-c\" option. This update describes\ncorrectly that multiple configuration files must be separated by a comma.\n(BZ#760001)\n\n* Integers truncated from 64 to 32-bit were not correctly evaluated. As a\nconsequence, the snmpd daemon could enter an endless loop when encoding the\ntruncated integers to network format. This update modifies the underlying\ncode so that snmpd correctly checks truncated 64-bit integers. Now, snmpd\navoids an endless loop. (BZ#783892)\n\n* snmpd did not correctly check for interrupted system calls when\nenumerating existing IPv6 network prefixes during startup. As a\nconsequence, snmpd could prematurely exit when receiving a signal during\nthis enumeration. This update checks the network prefix enumeration code\nfor interrupted system calls. Now, snmpd no longer terminates when a signal\nis received. (BZ#799699)\n\n* snmpd used the wrong length of COUNTER64 values in the AgentX protocol.\nAs a consequence, snmpd could not decode two consecutive COUNTER64 values\nin one AgentX packet. This update uses the correct COUNTER64 size and can\nprocess two or mode COUNTER64 values in AgentX communication. (BZ#803585)\n\n* snmpd ignored the \"-e\" parameter of the \"trapsess\" option in the snmpd\nconfiguration file. As a result, outgoing traps were incorrectly sent with\nthe default EngineID of snmpd when configuring \"trapsess\" with an explicit\nEngineID. This update modifies the underlying code to send outgoing traps\nusing the EngineID as specified in the \"trapsess -e\" parameter in the\nconfiguration file. (BZ#805689)\n\n* snmpd did not correctly encode negative Request-IDs in outgoing requests,\nfor example during trap operations. As a consequence, a 32-bit value could\nbe encoded in 5 bytes instead of 4, and the outgoing requests were refused\nby certain implementations of the SNMP protocol as invalid. With this\nupdate, a Request-ID can no longer become negative and is always encoded in\n4 bytes. (BZ#818259)\n\n* snmpd ignored the port number of the \"clientaddr\" option when specifying\nthe source address of outgoing SNMP requests. As a consequence, the system\nassigned a random address. This update allows to specify both the port\nnumber and the source IP address in the \"clientaddr\" option. Now,\nadministrators can increase security with firewall rules and\nSecurity-Enhanced Linux (SELinux) policies by configuring a specific source\nport of outgoing traps and other requests. (BZ#828691)\n\n* snmpd did not correctly process responses to internal queries when\ninitializing monitoring enabled by the \"monitor\" option in the\n\"/etc/snmp/snmpd.conf\" configuration file. As a consequence, snmpd was not\nfully initialized and the error message \"failed to run mteTrigger query\"\nappeared in the system log 30 seconds after the snmpd startup. This update\nexplicitly checks for responses to internal monitoring queries. (BZ#830042)\n\nUsers of net-snmp should upgrade to these updated packages, which contain\nbackported patches to correct these issues. After installing the update,\nthe snmpd and snmptrapd daemons will be restarted automatically.",
    "advisory": {
      "from": "secalert@redhat.com",
      "severity": "Moderate",
      "rights": "Copyright 2013 Red Hat, Inc.",
      "issued": {
        "date": "2013-01-08"
      },
      "updated": {
        "date": "2013-01-08"
      },
      "cve": [
        {
          "text": "CVE-2012-2141",
          "href": "https://access.redhat.com/security/cve/CVE-2012-2141",
          "impact": "moderate",
          "public": "20120424",
          "cvss_2": "4.3/AV:N/AC:M/Au:N/C:N/I:N/A:P"
        }
      ],
      "bugzilla": [
        {
          "text": "CVE-2012-2141 net-snmp: Array index error, leading to out-of heap-based buffer read (snmpd crash)",
          "href": "https://bugzilla.redhat.com/815813",
          "id": "815813"
        }
      ],
      "affected_cpe_list": {
        "cpe": [
          "cpe:/o:redhat:enterprise_linux:5",
          "cpe:/o:redhat:enterprise_linux:5::client",
          "cpe:/o:redhat:enterprise_linux:5::client_workstation",
          "cpe:/o:redhat:enterprise_linux:5::server"
        ]
      }
    }
  },
  "criteria": {
    "operator": "OR",
    "criterias": [
      {
        "operator": "AND",
        "criterias": [
          {
            "operator": "OR",
            "criterias": [
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20130124001",
                    "comment": "net-snmp is earlier than 1:5.3.2.2-20.el5"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20071045002",
                    "comment": "net-snmp is signed with Red Hat redhatrelease2 key"
                  }
                ]
              },
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20130124003",
                    "comment": "net-snmp-devel is earlier than 1:5.3.2.2-20.el5"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20071045004",
                    "comment": "net-snmp-devel is signed with Red Hat redhatrelease2 key"
                  }
                ]
              },
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20130124005",
                    "comment": "net-snmp-libs is earlier than 1:5.3.2.2-20.el5"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20071045006",
                    "comment": "net-snmp-libs is signed with Red Hat redhatrelease2 key"
                  }
                ]
              },
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20130124007",
                    "comment": "net-snmp-perl is earlier than 1:5.3.2.2-20.el5"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20071045008",
                    "comment": "net-snmp-perl is signed with Red Hat redhatrelease2 key"
                  }
                ]
              },
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20130124009",
                    "comment": "net-snmp-utils is earlier than 1:5.3.2.2-20.el5"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20071045010",
                    "comment": "net-snmp-utils is signed with Red Hat redhatrelease2 key"
                  }
                ]
              }
            ]
          }
        ],
        "criterions": [
          {
            "test_ref": "oval:com.redhat.rhba:tst:20070331005",
            "comment": "Red Hat Enterprise Linux 5 is installed"
          }
        ]
      }
    ],
    "criterions": [
      {
        "test_ref": "oval:com.redhat.rhba:tst:20070331006",
        "comment": "Red Hat Enterprise Linux must be installed"
      }
    ]
  }
}
