{
	"class": "patch",
	"id": "oval:com.redhat.rhsa:def:20170340",
	"version": "633",
	"metadata": {
		"title": "RHSA-2017:0340: Red Hat Enterprise Linux 5 One-Month Retirement Notice (Low)",
		"affected": {
			"family": "unix",
			"platform": [
				"Red Hat Enterprise Linux 5"
			]
		},
		"reference": [
			{
				"ref_id": "RHSA-2017:0340",
				"ref_url": "https://access.redhat.com/errata/RHSA-2017:0340",
				"source": "RHSA"
			}
		],
		"description": "In accordance with the Red Hat Enterprise Linux Errata Support Policy, support for Red Hat Enterprise Linux 5 will be retired on March 31, 2017, at the end of Production Phase 3. Until that date, customers will continue to receive Critical impact security patches and selected Urgent priority bug fixes for RHEL 5.11 (the final RHEL 5 release). On that date, active support included with your RHEL Premium or Standard subscription will conclude. This means that customers will continue to have access to all previously released content. In addition, limited technical support will be available through Red Hat's Global Support Services as described in the Knowledge Base article available at https://access.redhat.com/articles/64664 (under \"non-current minor release\").\n\nHowever, we recognize that some customers will wish to remain on Red Hat Enterprise Linux 5 even after the March 31, 2017 retirement date. To meet this customer requirement, Red Hat will offer customers the option to purchase the Extended Life Cycle Support (ELS) Add-On as an annually renewable subscription. This ELS Add-On provides customers with up to an additional three and a half (3.5) years of Critical impact security fixes and selected Urgent priority bug fixes for RHEL 5.11. RHEL 5 ELS coverage will conclude on November 30, 2020.\n\nTo enjoy even more comprehensive product support, we encourage customers to migrate from Red Hat Enterprise Linux 5 to a more recent version. As a benefit of the Red Hat subscription, customers may use their active subscriptions to entitle any system on any currently supported Red Hat Enterprise Linux release.\n\nInstructions for migrating from RHEL 5 to RHEL7 are available at https://access.redhat.com/articles/1211223. Red Hat also offers a Pre-upgrade Assistant tool to aid with the migration of RHEL 5 systems to RHEL 7. For more information about this tool, please see https://access.redhat.com/solutions/1468623.\n\nDetails of the Red Hat Enterprise Linux life cycle can be found here: https://access.redhat.com/support/policy/updates/errata/",
		"advisory": {
			"from": "secalert@redhat.com",
			"severity": "Low",
			"rights": "Copyright 2017 Red Hat, Inc.",
			"issued": {
				"date": "2017-02-28"
			},
			"updated": {
				"date": "2017-02-28"
			},
			"affected_cpe_list": {
				"cpe": [
					"cpe:/o:redhat:enterprise_linux:5",
					"cpe:/o:redhat:enterprise_linux:5::client",
					"cpe:/o:redhat:enterprise_linux:5::server"
				]
			}
		}
	},
	"criteria": {
		"operator": "OR",
		"criterias": [
			{
				"operator": "AND",
				"criterias": [
					{
						"operator": "OR",
						"criterias": [
							{
								"operator": "AND",
								"criterions": [
									{
										"test_ref": "oval:com.redhat.rhsa:tst:20170340001",
										"comment": "redhat-release is earlier than 0:5Server-5.11.0.8"
									},
									{
										"test_ref": "oval:com.redhat.rhsa:tst:20160561002",
										"comment": "redhat-release is signed with Red Hat redhatrelease key"
									}
								]
							},
							{
								"operator": "AND",
								"criterions": [
									{
										"test_ref": "oval:com.redhat.rhsa:tst:20170340003",
										"comment": "redhat-release is earlier than 0:5Client-5.11.0.8"
									},
									{
										"test_ref": "oval:com.redhat.rhsa:tst:20160561002",
										"comment": "redhat-release is signed with Red Hat redhatrelease key"
									}
								]
							}
						]
					}
				],
				"criterions": [
					{
						"test_ref": "oval:com.redhat.rhba:tst:20070331005",
						"comment": "Red Hat Enterprise Linux 5 is installed"
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:com.redhat.rhba:tst:20070331006",
				"comment": "Red Hat Enterprise Linux must be installed"
			}
		]
	}
}
