{
  "class": "patch",
  "id": "oval:com.redhat.rhsa:def:20121149",
  "version": "638",
  "metadata": {
    "title": "RHSA-2012:1149: sudo security and bug fix update (Moderate)",
    "affected": {
      "family": "unix",
      "platform": [
        "Red Hat Enterprise Linux 5"
      ]
    },
    "reference": [
      {
        "ref_id": "RHSA-2012:1149",
        "ref_url": "https://access.redhat.com/errata/RHSA-2012:1149",
        "source": "RHSA"
      },
      {
        "ref_id": "CVE-2012-3440",
        "ref_url": "https://access.redhat.com/security/cve/CVE-2012-3440",
        "source": "CVE"
      }
    ],
    "description": "The sudo (superuser do) utility allows system administrators to give\ncertain users the ability to run commands as root.\n\nAn insecure temporary file use flaw was found in the sudo package's\npost-uninstall script. A local attacker could possibly use this flaw to\noverwrite an arbitrary file via a symbolic link attack, or modify the\ncontents of the \"/etc/nsswitch.conf\" file during the upgrade or removal of\nthe sudo package. (CVE-2012-3440)\n\nThis update also fixes the following bugs:\n\n* Previously, sudo escaped non-alphanumeric characters in commands using\n\"sudo -s\" or \"sudo -\" at the wrong place and interfered with the\nauthorization process. Some valid commands were not permitted. Now,\nnon-alphanumeric characters escape immediately before the command is\nexecuted and no longer interfere with the authorization process.\n(BZ#844418)\n\n* Prior to this update, the sudo utility could, under certain\ncircumstances, fail to receive the SIGCHLD signal when it was executed\nfrom a process that blocked the SIGCHLD signal. As a consequence, sudo\ncould become suspended and fail to exit. This update modifies the signal\nprocess mask so that sudo can exit and sends the correct output.\n(BZ#844419)\n\n* The sudo update RHSA-2012:0309 introduced a regression that caused the\nSecurity-Enhanced Linux (SELinux) context of the \"/etc/nsswitch.conf\" file\nto change during the installation or upgrade of the sudo package. This\ncould cause various services confined by SELinux to no longer be permitted\nto access the file. In reported cases, this issue prevented PostgreSQL and\nPostfix from starting. (BZ#842759)\n\n* Updating the sudo package resulted in the \"sudoers\" line in\n\"/etc/nsswitch.conf\" being removed. This update corrects the bug in the\nsudo package's post-uninstall script that caused this issue. (BZ#844420)\n\n* Prior to this update, a race condition bug existed in sudo. When a\nprogram was executed with sudo, the program could possibly exit\nsuccessfully before sudo started waiting for it. In this situation, the\nprogram would be left in a zombie state and sudo would wait for it\nendlessly, expecting it to still be running. (BZ#844978)\n\nAll users of sudo are advised to upgrade to this updated package, which\ncontains backported patches to correct these issues.",
    "advisory": {
      "from": "secalert@redhat.com",
      "severity": "Moderate",
      "rights": "Copyright 2012 Red Hat, Inc.",
      "issued": {
        "date": "2012-08-07"
      },
      "updated": {
        "date": "2012-08-07"
      },
      "cve": [
        {
          "text": "CVE-2012-3440",
          "href": "https://access.redhat.com/security/cve/CVE-2012-3440",
          "impact": "moderate",
          "public": "20120807",
          "cwe": "CWE-367",
          "cvss_2": "5.6/AV:L/AC:H/Au:N/C:N/I:C/A:C"
        }
      ],
      "bugzilla": [
        {
          "text": "CVE-2012-3440 sudo: insecure temporary file use in RPM %postun script",
          "href": "https://bugzilla.redhat.com/844442",
          "id": "844442"
        }
      ],
      "affected_cpe_list": {
        "cpe": [
          "cpe:/o:redhat:enterprise_linux:5",
          "cpe:/o:redhat:enterprise_linux:5::client",
          "cpe:/o:redhat:enterprise_linux:5::server"
        ]
      }
    }
  },
  "criteria": {
    "operator": "OR",
    "criterias": [
      {
        "operator": "AND",
        "criterions": [
          {
            "test_ref": "oval:com.redhat.rhba:tst:20070331005",
            "comment": "Red Hat Enterprise Linux 5 is installed"
          },
          {
            "test_ref": "oval:com.redhat.rhsa:tst:20121149001",
            "comment": "sudo is earlier than 0:1.7.2p1-14.el5_8.2"
          },
          {
            "test_ref": "oval:com.redhat.rhsa:tst:20090267002",
            "comment": "sudo is signed with Red Hat redhatrelease2 key"
          }
        ]
      }
    ],
    "criterions": [
      {
        "test_ref": "oval:com.redhat.rhba:tst:20070331006",
        "comment": "Red Hat Enterprise Linux must be installed"
      }
    ]
  }
}
