{
  "class": "patch",
  "id": "oval:com.redhat.rhsa:def:20130135",
  "version": "636",
  "metadata": {
    "title": "RHSA-2013:0135: gtk2 security and bug fix update (Low)",
    "affected": {
      "family": "unix",
      "platform": [
        "Red Hat Enterprise Linux 5"
      ]
    },
    "reference": [
      {
        "ref_id": "RHSA-2013:0135",
        "ref_url": "https://access.redhat.com/errata/RHSA-2013:0135",
        "source": "RHSA"
      },
      {
        "ref_id": "CVE-2012-2370",
        "ref_url": "https://access.redhat.com/security/cve/CVE-2012-2370",
        "source": "CVE"
      }
    ],
    "description": "GIMP Toolkit (GTK+) is a multi-platform toolkit for creating graphical user\ninterfaces.\n\nAn integer overflow flaw was found in the X BitMap (XBM) image file loader\nin GTK+. A remote attacker could provide a specially-crafted XBM image file\nthat, when opened in an application linked against GTK+ (such as Nautilus),\nwould cause the application to crash. (CVE-2012-2370)\n\nThis update also fixes the following bugs:\n\n* Due to a bug in the Input Method GTK+ module, the usage of the Taiwanese\nBig5 (zh_TW.Big-5) locale led to the unexpected termination of certain\napplications, such as the GDM greeter. The bug has been fixed, and the\nTaiwanese locale no longer causes applications to terminate unexpectedly.\n(BZ#487630)\n\n* When a file was initially selected after the GTK+ file chooser dialog was\nopened and the Location field was visible, pressing the Enter key did not\nopen the file. With this update, the initially selected file is opened\nregardless of the visibility of the Location field. (BZ#518483)\n\n* When a file was initially selected after the GTK+ file chooser dialog was\nopened and the Location field was visible, pressing the Enter key did not\nchange into the directory. With this update, the dialog changes into the\ninitially selected directory regardless of the visibility of the Location\nfield. (BZ#523657)\n\n* Previously, the GTK Print dialog did not reflect the user-defined printer\npreferences stored in the ~/.cups/lpoptions file, such as those set in the\nDefault Printer preferences panel. Consequently, the first device in the\nprinter list was always set as a default printer. With this update, the\nunderlying source code has been enhanced to parse the option file. As a\nresult, the default values in the print dialog are set to those previously\nspecified by the user. (BZ#603809)\n\n* The GTK+ file chooser did not properly handle saving of nameless files.\nConsequently, attempting to save a file without specifying a file name\ncaused GTK+ to become unresponsive. With this update, an explicit test for\nthis condition has been added into the underlying source code. As a result,\nGTK+ no longer hangs in the described scenario. (BZ#702342)\n\n* When using certain graphics tablets, the GTK+ library incorrectly\ntranslated the input coordinates. Consequently, an offset occurred between\nthe position of the pen and the content drawn on the screen. This issue was\nlimited to the following configuration: a Wacom tablet with input\ncoordinates bound to a single monitor in a dual head configuration, drawing\nwith a pen with the pressure sensitivity option enabled. With this update,\nthe coordinate translation method has been changed, and the offset is no\nlonger present in the described configuration. (BZ#743658)\n\n* Previously, performing drag and drop operations on tabs in applications\nusing the GtkNotebook widget could lead to releasing the same resource\ntwice. Eventually, this behavior caused the applications to terminate with\na segmentation fault. This bug has been fixed, and the applications using\nGtkNotebook no longer terminate in the aforementioned scenario. (BZ#830901)\n\nAll users of GTK+ are advised to upgrade to these updated packages, which\ncontain backported patches to correct these issues.",
    "advisory": {
      "from": "secalert@redhat.com",
      "severity": "Low",
      "rights": "Copyright 2013 Red Hat, Inc.",
      "issued": {
        "date": "2013-01-08"
      },
      "updated": {
        "date": "2013-01-08"
      },
      "cve": [
        {
          "text": "CVE-2012-2370",
          "href": "https://access.redhat.com/security/cve/CVE-2012-2370",
          "impact": "low",
          "public": "20120325",
          "cwe": "CWE-190",
          "cvss_2": "4.3/AV:N/AC:M/Au:N/C:N/I:N/A:P"
        }
      ],
      "bugzilla": [
        {
          "text": "CVE-2012-2370 gdk-pixbuf: DoS (GLib error and application abort) due to an integer overflow in the XBM image file format loader",
          "href": "https://bugzilla.redhat.com/822468",
          "id": "822468"
        }
      ],
      "affected_cpe_list": {
        "cpe": [
          "cpe:/o:redhat:enterprise_linux:5",
          "cpe:/o:redhat:enterprise_linux:5::client",
          "cpe:/o:redhat:enterprise_linux:5::client_workstation",
          "cpe:/o:redhat:enterprise_linux:5::server"
        ]
      }
    }
  },
  "criteria": {
    "operator": "OR",
    "criterias": [
      {
        "operator": "AND",
        "criterias": [
          {
            "operator": "OR",
            "criterias": [
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20130135001",
                    "comment": "gtk2 is earlier than 0:2.10.4-29.el5"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20130135002",
                    "comment": "gtk2 is signed with Red Hat redhatrelease2 key"
                  }
                ]
              },
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20130135003",
                    "comment": "gtk2-devel is earlier than 0:2.10.4-29.el5"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20130135004",
                    "comment": "gtk2-devel is signed with Red Hat redhatrelease2 key"
                  }
                ]
              }
            ]
          }
        ],
        "criterions": [
          {
            "test_ref": "oval:com.redhat.rhba:tst:20070331005",
            "comment": "Red Hat Enterprise Linux 5 is installed"
          }
        ]
      }
    ],
    "criterions": [
      {
        "test_ref": "oval:com.redhat.rhba:tst:20070331006",
        "comment": "Red Hat Enterprise Linux must be installed"
      }
    ]
  }
}
