{
  "class": "patch",
  "id": "oval:com.redhat.rhsa:def:20111073",
  "version": "646",
  "metadata": {
    "title": "RHSA-2011:1073: bash security, bug fix, and enhancement update (Low)",
    "affected": {
      "family": "unix",
      "platform": [
        "Red Hat Enterprise Linux 5"
      ]
    },
    "reference": [
      {
        "ref_id": "RHSA-2011:1073",
        "ref_url": "https://access.redhat.com/errata/RHSA-2011:1073",
        "source": "RHSA"
      },
      {
        "ref_id": "CVE-2008-5374",
        "ref_url": "https://access.redhat.com/security/cve/CVE-2008-5374",
        "source": "CVE"
      }
    ],
    "description": "Bash is the default shell for Red Hat Enterprise Linux.\n\nIt was found that certain scripts bundled with the Bash documentation\ncreated temporary files in an insecure way. A malicious, local user could\nuse this flaw to conduct a symbolic link attack, allowing them to overwrite\nthe contents of arbitrary files accessible to the victim running the\nscripts. (CVE-2008-5374)\n\nThis update fixes the following bugs:\n\n* When using the source builtin at location \".\", occasionally, bash\nopted to preserve internal consistency and abort scripts. This caused\nbash to abort scripts that assigned values to read-only variables.\nThis is now fixed to ensure that such scripts are now executed as\nwritten and not aborted. (BZ#448508)\n\n* When the tab key was pressed for auto-completion options for the typed\ntext, the cursor moved to an unexpected position on a previous line if\nthe prompt contained characters that cannot be viewed and a \"\\]\". This\nis now fixed to retain the cursor at the expected position at the end of\nthe target line after autocomplete options correctly display. (BZ#463880)\n\n* Bash attempted to interpret the NOBITS .dynamic section of the ELF\nheader. This resulted in a \"^D: bad ELF interpreter: No such\nfile or directory\" message. This is fixed to ensure that the invalid\n\"^D\" does not appear in the error message. (BZ#484809)\n\n* The $RANDOM variable in Bash carried over values from a previous\nexecution for later jobs. This is fixed and the $RANDOM variable\ngenerates a new random number for each use. (BZ#492908)\n\n* When Bash ran a shell script with an embedded null character, bash's\nsource builtin parsed the script incorrectly. This is fixed and\nbash's source builtin correctly parses shell script null characters.\n(BZ#503701)\n\n* The bash manual page for \"trap\" did not mention that signals ignored upon\nentry cannot be listed later. The manual page was updated for this update\nand now specifically notes that \"Signals ignored upon entry to the shell\ncannot be trapped, reset or listed\". (BZ#504904)\n\n* Bash's readline incorrectly displayed additional text when resizing\nthe terminal window when text spanned more than one line, which caused\nincorrect display output. This is now fixed to ensure that text in more\nthan one line in a resized window displays as expected. (BZ#525474)\n\n* Previously, bash incorrectly displayed \"Broken pipe\" messages for\nbuiltins like \"echo\" and \"printf\" when output did not succeed due to\nEPIPE. This is fixed to ensure that the unnecessary \"Broken pipe\"\nmessages no longer display. (BZ#546529)\n\n* Inserts with the repeat function were not possible after a deletion in\nvi-mode. This has been corrected and, with this update, the repeat function\nworks as expected after a deletion. (BZ#575076)\n\n* In some situations, bash incorrectly appended \"/\" to files instead of\njust directories during tab-completion, causing incorrect\nauto-completions. This is fixed and auto-complete appends \"/\" only to\ndirectories. (BZ#583919)\n\n* Bash had a memory leak in the \"read\" builtin when the number of fields\nbeing read was not equal to the number of variables passed as arguments,\ncausing a shell script crash. This is fixed to prevent a memory leak and\nshell script crash. (BZ#618393)\n\n* /usr/share/doc/bash-3.2/loadables in the bash package contained source\nfiles which would not build due to missing C header files. With this\nupdate, the unusable (and unbuildable) source files were removed from the\npackage. (BZ#663656)\n\nThis update also adds the following enhancement:\n\n* The system-wide \"/etc/bash.bash_logout\" bash logout file is now enabled.\nThis allows administrators to write system-wide logout actions for all\nusers. (BZ#592979)\n\nUsers of bash are advised to upgrade to this updated package, which\ncontains backported patches to resolve these issues and add this\nenhancement.",
    "advisory": {
      "from": "secalert@redhat.com",
      "severity": "Low",
      "rights": "Copyright 2011 Red Hat, Inc.",
      "issued": {
        "date": "2011-07-21"
      },
      "updated": {
        "date": "2011-07-21"
      },
      "cve": [
        {
          "text": "CVE-2008-5374",
          "href": "https://access.redhat.com/security/cve/CVE-2008-5374",
          "impact": "low",
          "public": "20080813",
          "cvss_2": "1.2/AV:L/AC:H/Au:N/C:N/I:P/A:N"
        }
      ],
      "bugzilla": [
        {
          "text": "CVE-2008-5374 bash: Insecure temporary file use in aliasconv.sh, aliasconv.bash, cshtobash (symlink attack)",
          "href": "https://bugzilla.redhat.com/475474",
          "id": "475474"
        }
      ],
      "affected_cpe_list": {
        "cpe": [
          "cpe:/o:redhat:enterprise_linux:5",
          "cpe:/o:redhat:enterprise_linux:5::client",
          "cpe:/o:redhat:enterprise_linux:5::server"
        ]
      }
    }
  },
  "criteria": {
    "operator": "OR",
    "criterias": [
      {
        "operator": "AND",
        "criterions": [
          {
            "test_ref": "oval:com.redhat.rhba:tst:20070331005",
            "comment": "Red Hat Enterprise Linux 5 is installed"
          },
          {
            "test_ref": "oval:com.redhat.rhsa:tst:20111073001",
            "comment": "bash is earlier than 0:3.2-32.el5"
          },
          {
            "test_ref": "oval:com.redhat.rhsa:tst:20111073002",
            "comment": "bash is signed with Red Hat redhatrelease2 key"
          }
        ]
      }
    ],
    "criterions": [
      {
        "test_ref": "oval:com.redhat.rhba:tst:20070331006",
        "comment": "Red Hat Enterprise Linux must be installed"
      }
    ]
  }
}
