{
  "class": "patch",
  "id": "oval:com.redhat.rhsa:def:20130128",
  "version": "637",
  "metadata": {
    "title": "RHSA-2013:0128: conga security, bug fix, and enhancement update (Low)",
    "affected": {
      "family": "unix",
      "platform": [
        "Red Hat Enterprise Linux 5"
      ]
    },
    "reference": [
      {
        "ref_id": "RHSA-2013:0128",
        "ref_url": "https://access.redhat.com/errata/RHSA-2013:0128",
        "source": "RHSA"
      },
      {
        "ref_id": "CVE-2012-3359",
        "ref_url": "https://access.redhat.com/security/cve/CVE-2012-3359",
        "source": "CVE"
      }
    ],
    "description": "The Conga project is a management system for remote workstations. It\nconsists of luci, which is a secure web-based front end, and ricci, which\nis a secure daemon that dispatches incoming messages to underlying\nmanagement modules.\n\nIt was discovered that luci stored usernames and passwords in session\ncookies. This issue prevented the session inactivity timeout feature from\nworking correctly, and allowed attackers able to get access to a session\ncookie to obtain the victim's authentication credentials. (CVE-2012-3359)\n\nRed Hat would like to thank George Hedfors of Cybercom Sweden East AB for\nreporting this issue.\n\nThis update also fixes the following bugs:\n\n* Prior to this update, luci did not allow the fence_apc_snmp agent to be\nconfigured. As a consequence, users could not configure or view an existing\nconfiguration for fence_apc_snmp. This update adds a new screen that allows\nfence_apc_snmp to be configured. (BZ#832181)\n\n* Prior to this update, luci did not allow the SSL operation of the\nfence_ilo fence agent to be enabled or disabled. As a consequence, users\ncould not configure or view an existing configuration for the 'ssl'\nattribute for fence_ilo. This update adds a checkbox to show whether the\nSSL operation is enabled and allows users to edit that attribute.\n(BZ#832183)\n\n* Prior to this update, luci did not allow the \"identity_file\" attribute of\nthe fence_ilo_mp fence agent to be viewed or edited. As a consequence,\nusers could not configure or view an existing configuration for the\n\"identity_file\" attribute of the fence_ilo_mp fence agent. This update adds\na text input box to show the current state of the \"identity_file\" attribute\nof fence_ilo_mp and allows users to edit that attribute. (BZ#832185)\n\n* Prior to this update, redundant files and directories remained on the\nfile system at /var/lib/luci/var/pts and /usr/lib{,64}/luci/zope/var/pts\nwhen the luci package was uninstalled. This update removes these files\nand directories when the luci package is uninstalled. (BZ#835649)\n\n* Prior to this update, the \"restart-disable\" recovery policy was not\ndisplayed in the recovery policy list from which users could select when\nthey configure a recovery policy for a failover domain. As a consequence,\nthe \"restart-disable\" recovery policy could not be set with the luci GUI.\nThis update adds the \"restart-disable\" recovery option to the recovery\npolicy pulldown list. (BZ#839732)\n\n* Prior to this update, line breaks that were not anticipated in the \"yum\nlist\" output could cause package upgrade and/or installation to fail when\ncreating clusters or adding nodes to existing clusters. As a consequence,\ncreating clusters and adding cluster nodes to existing clusters could fail.\nThis update modifies the ricci daemon to be able to correctly handle line\nbreaks in the \"yum list\" output. (BZ#842865)\n\nIn addition, this update adds the following enhancements:\n\n* This update adds support for configuring the Intel iPDU fence agent to\nthe luci package. (BZ#741986)\n\n* This update adds support for viewing and changing the state of the new\n'nfsrestart' attribute to the FS and Cluster FS resource agent\nconfiguration screens. (BZ#822633)\n\nAll users of conga are advised to upgrade to these updated packages, which\nresolve these issues and add these enhancements. After installing this\nupdate, the luci and ricci services will be restarted automatically.",
    "advisory": {
      "from": "secalert@redhat.com",
      "severity": "Low",
      "rights": "Copyright 2013 Red Hat, Inc.",
      "issued": {
        "date": "2013-01-08"
      },
      "updated": {
        "date": "2013-01-08"
      },
      "cve": [
        {
          "text": "CVE-2012-3359",
          "href": "https://access.redhat.com/security/cve/CVE-2012-3359",
          "impact": "low",
          "public": "20130107",
          "cvss_2": "3.7/AV:L/AC:H/Au:N/C:P/I:P/A:P"
        }
      ],
      "bugzilla": [
        {
          "text": "CVE-2012-3359 CVE-2013-7347 conga: insecure handling of luci web interface sessions",
          "href": "https://bugzilla.redhat.com/607179",
          "id": "607179"
        }
      ],
      "affected_cpe_list": {
        "cpe": [
          "cpe:/a:redhat:rhel_cluster:5"
        ]
      }
    }
  },
  "criteria": {
    "operator": "OR",
    "criterias": [
      {
        "operator": "AND",
        "criterias": [
          {
            "operator": "OR",
            "criterias": [
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20130128001",
                    "comment": "luci is earlier than 0:0.12.2-64.el5"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhba:tst:20070331002",
                    "comment": "luci is signed with Red Hat redhatrelease2 key"
                  }
                ]
              },
              {
                "operator": "AND",
                "criterions": [
                  {
                    "test_ref": "oval:com.redhat.rhsa:tst:20130128003",
                    "comment": "ricci is earlier than 0:0.12.2-64.el5"
                  },
                  {
                    "test_ref": "oval:com.redhat.rhba:tst:20070331004",
                    "comment": "ricci is signed with Red Hat redhatrelease2 key"
                  }
                ]
              }
            ]
          }
        ],
        "criterions": [
          {
            "test_ref": "oval:com.redhat.rhba:tst:20070331005",
            "comment": "Red Hat Enterprise Linux 5 is installed"
          }
        ]
      }
    ],
    "criterions": [
      {
        "test_ref": "oval:com.redhat.rhba:tst:20070331006",
        "comment": "Red Hat Enterprise Linux must be installed"
      }
    ]
  }
}
