{
	"class": "patch",
	"id": "oval:com.redhat.rhsa:def:20080680",
	"version": "644",
	"metadata": {
		"title": "RHSA-2008:0680: vsftpd security and bug fix update (Moderate)",
		"affected": {
			"family": "unix",
			"platform": [
				"Red Hat Enterprise Linux 4"
			]
		},
		"reference": [
			{
				"ref_id": "RHSA-2008:0680",
				"ref_url": "https://access.redhat.com/errata/RHSA-2008:0680",
				"source": "RHSA"
			},
			{
				"ref_id": "CVE-2008-2375",
				"ref_url": "https://access.redhat.com/security/cve/CVE-2008-2375",
				"source": "CVE"
			}
		],
		"description": "vsftpd (Very Secure File Transfer Protocol (FTP) daemon) is a secure FTP\nserver for Linux and Unix-like systems.\n\nThe version of vsftpd as shipped in Red Hat Enterprise Linux 4 when used in\ncombination with Pluggable Authentication Modules (PAM) had a memory leak\non an invalid authentication attempt. Since vsftpd prior to version 2.0.5\nallows any number of invalid attempts on the same connection this memory\nleak could lead to an eventual DoS. (CVE-2008-2375)\n\nThis update mitigates this security issue by including a backported patch\nwhich terminates a session after a given number of failed log in attempts.\nThe default number of attempts is 3 and this can be configured using the\n\"max_login_fails\" directive.\n\nThis package also addresses the following bugs:\n\n* when uploading unique files, a bug in vsftpd caused the file to be saved\nwith a suffix '.1' even when no previous file with that name existed. This\nissues is resolved in this package.\n\n* when vsftpd was run through the init script, it was possible for the init\nscript to print an 'OK' message, even though the vsftpd may not have\nstarted. The init script no longer produces a false verification with this\nupdate.\n\n* vsftpd only supported usernames with a maximum length of 32 characters.\nThe updated package now supports usernames up to 128 characters long.\n\n* a system flaw meant vsftpd output could become dependent on the timing or\nsequence of other events, even when the \"lock_upload_files\" option was set.\nIf a file, filename.ext, was being uploaded and a second transfer of the\nfile, filename.ext, was started before the first transfer was finished, the\nresultant uploaded file was a corrupt concatenation of the latter upload\nand the tail of the earlier upload. With this updated package, vsftpd\nallows the earlier upload to complete before overwriting with the latter\nupload, fixing the issue.\n\n* the 'lock_upload_files' option was not documented in the manual page. A\nnew manual page describing this option is included in this package.\n\n* vsftpd did not support usernames that started with an underscore or a\nperiod character. These special characters are now allowed at the beginning\nof a username.\n\n* when storing a unique file, vsftpd could cause an error for some clients.\nThis is rectified in this package.\n\n* vsftpd init script was found to not be Linux Standards Base compliant.\nThis update corrects their exit codes to conform to the standard.\n\nAll vsftpd users are advised to upgrade to this updated package, which\nresolves these issues.",
		"advisory": {
			"from": "secalert@redhat.com",
			"severity": "Moderate",
			"rights": "Copyright 2008 Red Hat, Inc.",
			"issued": {
				"date": "2008-07-24"
			},
			"updated": {
				"date": "2008-07-24"
			},
			"cve": [
				{
					"text": "CVE-2008-2375",
					"href": "https://access.redhat.com/security/cve/CVE-2008-2375",
					"impact": "moderate",
					"public": "20060628",
					"cwe": "CWE-401"
				}
			],
			"bugzilla": [
				{
					"text": "CVE-2008-2375 older vsftpd authentication memory leak",
					"href": "https://bugzilla.redhat.com/453376",
					"id": "453376"
				}
			],
			"affected_cpe_list": {
				"cpe": [
					"cpe:/o:redhat:enterprise_linux:4",
					"cpe:/o:redhat:enterprise_linux:4::as",
					"cpe:/o:redhat:enterprise_linux:4::es"
				]
			}
		}
	},
	"criteria": {
		"operator": "OR",
		"criterias": [
			{
				"operator": "AND",
				"criterions": [
					{
						"test_ref": "oval:com.redhat.rhba:tst:20070304025",
						"comment": "Red Hat Enterprise Linux 4 is installed"
					},
					{
						"test_ref": "oval:com.redhat.rhsa:tst:20080680001",
						"comment": "vsftpd is earlier than 0:2.0.1-6.el4"
					},
					{
						"test_ref": "oval:com.redhat.rhsa:tst:20080680002",
						"comment": "vsftpd is signed with Red Hat redhatrelease2 key"
					}
				]
			}
		],
		"criterions": [
			{
				"test_ref": "oval:com.redhat.rhba:tst:20070304026",
				"comment": "Red Hat Enterprise Linux must be installed"
			}
		]
	}
}
